app/controllers/debts_controller.rb

SELECT "debts".* FROM "debts"
---
  def index
    @debts = Debt.all

INSERT INTO "debts" ("amount", "created_at", "duedate", "person_id", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 50], ["created_at", Wed, 17 Oct 2012 10:50:54 UTC +00:00], ["duedate", Wed, 31 Oct 2012], ["person_id", 1], ["status", false], ["updated_at", Wed, 17 Oct 2012 10:50:54 UTC +00:00]]
---
  def create
    @debt = Debt.new(params[:debt])
    if !@debt.amount.blank?
      @person = Person.find(@debt.person_id)
      @person.update_attribute("debt", @person.debt + @debt.amount)
    end
    if @debt.save

SELECT "debts".* FROM "debts" WHERE "debts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "debts" SET "status" = 't', "updated_at" = '2012-10-17 10:55:04.419561' WHERE "debts"."id" = 1
---
  def markaspaid
    @debt = Debt.find(params[:id])
    @debt.update_attribute(:status, 1)