app/controllers/wallet_controller.rb

  def index
    @people = Person.all
    @debts = getUpComingDebts
    @paidCount = Debt.where("status = ?",true).count
---
SELECT COUNT(*) FROM "debts" WHERE (status = TRUE)